# Join the Tables
## Understanding the merge() and the concat() in Python pandas

Source code from Medium's article ["Join the Tables"](https://towardsdatascience.com/join-the-tables-ab7fd4fac26b), written by [Suraj Gurav](https://medium.com/@17.rsuraj).

# Importing libraries

In [1]:
import pandas as pd

# Creating DataFrames

In [3]:
countries = {'ID':["EU101","AS101","EU103","EU102","US111"],
             'Country': ["Germany", "India", "Belgium", "Austria",
                         "Mexico"
                        ]
            }

states = {'Countryname': ["France", "India", "Belgium", "Japan", "Mexico","Spain"],
          'statecount': [15, 7, 10, 9, 32, 10]
         }

europe ={'ID':["EU101","AS101","EU103","EU102","US112"],
         'EU_member': ["Yes", "No", "No", "No", "No"],
         'Airports': [36,126,5,6,77]
        }

df_one = pd.DataFrame(countries, index = [0,1,2,3,4])
df_two = pd.DataFrame(states, index = [1,2,3,4,5,6])
df_three = pd.DataFrame(europe, index = [0,1,2,3,4])

In [4]:
df_one

      ID  Country
0  EU101  Germany
1  AS101    India
2  EU103  Belgium
3  EU102  Austria
4  US111   Mexico

In [5]:
df_two

  Countryname  statecount
1      France          15
2       India           7
3     Belgium          10
4       Japan           9
5      Mexico          32
6       Spain          10

In [6]:
df_three

      ID EU_member  Airports
0  EU101       Yes        36
1  AS101        No       126
2  EU103        No         5
3  EU102        No         6
4  US112        No        77

# 1. Concat()

In [8]:
df_four = pd.concat([df_one, df_two])

In [9]:
df_four

      ID  Country Countryname  statecount
0  EU101  Germany         NaN         NaN
1  AS101    India         NaN         NaN
2  EU103  Belgium         NaN         NaN
3  EU102  Austria         NaN         NaN
4  US111   Mexico         NaN         NaN
1    NaN      NaN      France        15.0
2    NaN      NaN       India         7.0
3    NaN      NaN     Belgium        10.0
4    NaN      NaN       Japan         9.0
5    NaN      NaN      Mexico        32.0
6    NaN      NaN       Spain        10.0

In [10]:
df_four = pd.concat([df_one, df_two], axis=1)

In [11]:
df_four

      ID  Country Countryname  statecount
0  EU101  Germany         NaN         NaN
1  AS101    India      France        15.0
2  EU103  Belgium       India         7.0
3  EU102  Austria     Belgium        10.0
4  US111   Mexico       Japan         9.0
5    NaN      NaN      Mexico        32.0
6    NaN      NaN       Spain        10.0

In [12]:
df_four = pd.concat([df_one, df_two], keys=["df_one", "df_two"])

In [13]:
df_four

             ID  Country Countryname  statecount
df_one 0  EU101  Germany         NaN         NaN
       1  AS101    India         NaN         NaN
       2  EU103  Belgium         NaN         NaN
       3  EU102  Austria         NaN         NaN
       4  US111   Mexico         NaN         NaN
df_two 1    NaN      NaN      France        15.0
       2    NaN      NaN       India         7.0
       3    NaN      NaN     Belgium        10.0
       4    NaN      NaN       Japan         9.0
       5    NaN      NaN      Mexico        32.0
       6    NaN      NaN       Spain        10.0

## 1 outer : Union of DataFrames

In [15]:
df_five = pd.concat([df_one, df_two], axis=1, join="outer", 
                    keys=["df_one", "df_two"])

In [16]:
df_five

  df_one               df_two
      ID  Country Countryname statecount
0  EU101  Germany         NaN        NaN
1  AS101    India      France       15.0
2  EU103  Belgium       India        7.0
3  EU102  Austria     Belgium       10.0
4  US111   Mexico       Japan        9.0
5    NaN      NaN      Mexico       32.0
6    NaN      NaN       Spain       10.0

## 1 inner : Intersection of DataFrames

In [17]:
df_five = pd.concat([df_one, df_two], axis=1, join="inner", 
                    keys=["df_one", "df_two"])

In [18]:
df_five

  df_one               df_two
      ID  Country Countryname statecount
1  AS101    India      France         15
2  EU103  Belgium       India          7
3  EU102  Austria     Belgium         10
4  US111   Mexico       Japan          9

# 2. merge()

In [19]:
df_four = df_one.merge(df_three)

In [20]:
df_four

      ID  Country EU_member  Airports
0  EU101  Germany       Yes        36
1  AS101    India        No       126
2  EU103  Belgium        No         5
3  EU102  Austria        No         6